In [1]:
#dependencies
import pandas as pd

In [2]:
#importing data
school_cvspath = 'Resources\schools_complete.csv'
student_cvspath = 'Resources\students_complete.csv'

In [3]:
#Using Pandas to read data
school_data = pd.read_csv(school_cvspath)
student_data = pd.read_csv(student_cvspath)

In [4]:
#initial viewing of data
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
#initial viewing of data
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
#Checking columns actual names
student_data.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score'],
      dtype='object')

In [7]:
#Checking columns actual names
school_data.columns

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

In [8]:
#Cleaning up column names.
student_data = student_data.rename(columns={
    'student_name' : 'Student Name',
    'gender' : 'Gender',
    'grade' : 'Grade',
    'school_name' : 'School Name',
    'reading_score' : 'Reading Score',
    'math_score' : "Math Score"
})

In [9]:
#Rechecking cleaned data
student_data.head()

,Student ID,Student Name,Gender,Grade,School Name,Reading Score,Math Score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [10]:
#Cleaning up column names.
school_data = school_data.rename(columns={
    'school_name' : 'School Name',
    'type' : 'Type',
    'size' : 'Size',
    'budget' : 'Budget',
})

In [11]:
#Rechecking cleaned data
school_data.head()

   School ID            School Name      Type  Size   Budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [12]:
#Initial Statistics inquiries

total_students = student_data['Student Name'].count()
student_info = student_data['Student Name'].value_counts()
best_reading_score = student_data['Reading Score'].max()
worst_reading_score = student_data['Reading Score'].min()
avg_reading_score = student_data['Reading Score'].mean()
best_math_score = student_data['Math Score'].max()
worst_math_score = student_data['Math Score'].min()
avg_math_score = student_data['Math Score'].mean()

print(total_students)
print(student_info)
print(best_reading_score)
print(worst_reading_score)
print(avg_reading_score)
print(best_math_score)
print(worst_math_score)
print(avg_math_score)

39170
Michael Smith               26
David Johnson               16
Michael Williams            16
David Smith                 15
Daniel Johnson              14
Michael Brown               13
Michael Johnson             13
Michael Martinez            12
Lisa Smith                  11
Jennifer Anderson           11
Jessica Smith               11
Michelle Smith              11
James Smith                 10
John Smith                  10
Robert Jones                10
Michael Miller              10
Thomas Smith                10
John Johnson                10
Michael Davis               10
Amanda Johnson              10
Jennifer Johnson             9
Christopher Williams         9
James Williams               9
Robert Smith                 9
Jessica Johnson              9
David Miller                 9
Matthew Smith                9
Michael Clark                9
William Smith                9
Joshua Smith                 8
                            ..
Michael Hartman              1
Michelle Mcdonald            1
Pedro Hayes                  1
Eugene Miller                1
Matthew Huffman              1
Diane Nolan                  1
Tara Oliver                  1
Jared Williams               1
Matthew Hoffman              1
Lisa Tate                    1
Jacob Logan                  1
Catherine Herrera            1
Amanda Mahoney               1
Jeremy Everett               1
Joseph Ho                    1
Rachel Hanna DVM             1
Emily James                  1
Kevin Gray                   1
John Vaughn                  1
Diana Martin                 1
Nicholas Holland             1
Kayla Simpson                1
Robert Kaufman               1
Jared Harris                 1
Elizabeth Mendez             1
Ariana Ellis                 1
Sabrina Osborne              1
Kristina Paul                1
Mr. Gregg Rosario            1
Miss Colleen Stewart DDS     1
Name: Student Name, Length: 32715, dtype: int64
99
63
81.87784018381414
99
55
78.98537145774827

In [13]:
#Rounding Average - Data Cleanup
avg_reading_score = round(avg_reading_score, 0)
avg_math_score = round(avg_math_score, 0)

print(avg_reading_score)
print(avg_math_score)

82.0
79.0

In [14]:
#Additional Statistics
budget = school_data['Budget'].count()
print(budget)
budget_total = school_data['Budget'].sum()
budget_total

15

24649428

In [15]:
#Per student budget
per_student = total_students / budget_total
per_student

0.0015890835276177605

In [16]:
#merging on School Name for single data set.
schools_merge = pd.merge(student_data, school_data, on="School Name")
schools_merge.head()

,Student ID,Student Name,Gender,Grade,School Name,Reading Score,Math Score,School ID,Type,Size,Budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [17]:
# More stats
total_schools = school_data["School Name"].count()
total_schools
# Still need passing math and reading and overall. And format everything.
math_pass = 70
reading_pass = 70
overall_pass = (math_pass + reading_pass) / 2
overall_real = 70 in both

15

In [20]:
# Creating a summary DataFrame using above values
district_summary_df = pd.DataFrame({
    'Total Schools' : [total_schools],
    'Total Students' : [total_students],
    'Total Budget' : [budget_total],
    'Average Math Score' : [avg_math_score],
    'Average Reading Score' : [avg_reading_score],
    '% Passing Math' : [math_pass],
    '% Passing Reading' : [reading_pass],
    '% Overall Passing Rate' : [overall_pass],
})

district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score
0,15,39170,24649428,79.0,82.0

In [ ]:
#Formatting.
schools_merge['Budget'] = schools_merge['Budget'].map("${:,.2f}".format)
schools_merge['Size'] = schools_merge['Size'].map("{:,}".format)
schools_merge.head()